Ame1123/-RK3588-/firmware/stm32/Hardware/PWM.c
#include "stm32f10x.h"                  // Device header

/**
  * 函    数：PWM初始化
  * 参    数：无
  * 返 回 值：无
  */
void PWM_Init(void)
{
	/*开启时钟*/
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);			//开启TIM2的时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);			//开启TIM4的时钟（用于舵机4）
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);			//开启GPIOA的时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);			//开启GPIOB的时钟
	
	/*GPIO初始化 - GPIOA (舵机1,2,3)*/
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3;		// 初始化PA1、PA2和PA3引脚
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);						// 将PA1、PA2和PA3引脚初始化为复用推挽输出	
																// 受外设控制的引脚，均需要配置为复用模式
	
	/*GPIO初始化 - GPIOB (舵机4/5/6)*/
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_9;	// PB6(TIM4_CH1) PB7(TIM4_CH2) PB9(TIM4_CH4)
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);						// 将PB6/PB7/PB9初始化为复用推挽输出
	
	
	/*配置时钟源 - TIM2*/
	TIM_InternalClockConfig(TIM2);		//选择TIM2为内部时钟，若不调用此函数，TIM默认也为内部时钟
	
	/*时基单元初始化 - TIM2*/
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;				//定义结构体变量
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;     //时钟分频，选择不分频，此参数用于配置滤波器时钟，不影响时基单元功能
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up; //计数器模式，选择向上计数
	TIM_TimeBaseInitStructure.TIM_Period = 20000 - 1;				//计数周期，即ARR的值
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72 - 1;				//预分频器，即PSC的值
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;            //重复计数器，高级定时器才会用到
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);             //将结构体变量交给TIM_TimeBaseInit，配置TIM2的时基单元
	
	/*配置时钟源 - TIM4*/
	TIM_InternalClockConfig(TIM4);		//选择TIM4为内部时钟
	
	/*时基单元初始化 - TIM4*/
	TIM_TimeBaseInit(TIM4, &TIM_TimeBaseInitStructure);             //将结构体变量交给TIM_TimeBaseInit，配置TIM4的时基单元
	
	/*输出比较初始化 - TIM2*/ 
	TIM_OCInitTypeDef TIM_OCInitStructure;							//定义结构体变量
	TIM_OCStructInit(&TIM_OCInitStructure);                         //结构体初始化，若结构体没有完整赋值
	                                                                //则最好执行此函数，给结构体所有成员都赋一个默认值
	                                                                //避免结构体初值不确定的问题
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;               //输出比较模式，选择PWM模式1
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;       //输出极性，选择为高，若选择极性为低，则输出高低电平取反
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;   //输出使能
	TIM_OCInitStructure.TIM_Pulse = 1500;							//初始的CCR值 (1.5ms对应90度)
	TIM_OC2Init(TIM2, &TIM_OCInitStructure);                        //将结构体变量交给TIM_OC2Init，配置TIM2的输出比较通道2 (PA1-舵机1)
	TIM_OC3Init(TIM2, &TIM_OCInitStructure);                        //将结构体变量交给TIM_OC3Init，配置TIM2的输出比较通道3 (PA2-舵机2)
	TIM_OC4Init(TIM2, &TIM_OCInitStructure);                        //将结构体变量交给TIM_OC4Init，配置TIM2的输出比较通道4 (PA3-舵机3)
	
	/*输出比较初始化 - TIM4*/
	TIM_OC1Init(TIM4, &TIM_OCInitStructure);                        //将结构体变量交给TIM_OC1Init，配置TIM4的输出比较通道1 (PB6-舵机4)
	TIM_OCInitStructure.TIM_Pulse = 500;							//舵机5/6初始CCR (0.5ms对应0度)
	TIM_OC2Init(TIM4, &TIM_OCInitStructure);                        //配置TIM4的输出比较通道2 (PB7-舵机5)
	TIM_OCInitStructure.TIM_Pulse = 1389;							//舵机6初始CCR (80度对应约1389us)
	TIM_OC4Init(TIM4, &TIM_OCInitStructure);                        //配置TIM4的输出比较通道4 (PB9-舵机6)
	
	/*TIM使能*/
	TIM_Cmd(TIM2, ENABLE);			//使能TIM2，定时器开始运行
	TIM_Cmd(TIM4, ENABLE);			//使能TIM4，定时器开始运行
}

/**
  * 函    数：PWM设置CCR (TIM2通道2)
  * 参    数：Compare 要写入的CCR的值，范围：0~2500
  * 返 回 值：无
  * 注意事项：CCR和ARR共同决定占空比，此函数仅设置CCR的值，并不直接是占空比
  *           占空比Duty = CCR / (ARR + 1)
  */
void PWM_SetCompare2(uint16_t Compare)
{
	TIM_SetCompare2(TIM2, Compare);		//设置CCR2的值
}

/**
  * 函    数：PWM设置CCR3
  * 参    数：Compare 要写入的CCR的值，范围：0~2500
  * 返 回 值：无
  * 注意事项：CCR和ARR共同决定占空比，此函数仅设置CCR的值，并不直接是占空比
  *           占空比Duty = CCR / (ARR + 1)
  */
void PWM_SetCompare3(uint16_t Compare)
{
	TIM_SetCompare3(TIM2, Compare);		//设置CCR3的值
}

/**
  * 函    数：PWM设置CCR4
  * 参    数：Compare 要写入的CCR的值，范围：0~2500
  * 返 回 值：无
  * 注意事项：CCR和ARR共同决定占空比，此函数仅设置CCR的值，并不直接是占空比
  *           占空比Duty = CCR / (ARR + 1)
  */
void PWM_SetCompare4(uint16_t Compare)
{
	TIM_SetCompare4(TIM2, Compare);		//设置CCR4的值
}

/**
  * 函    数：PWM设置CCR (TIM4通道1)
  * 参    数：Compare 要写入的CCR的值，范围：0~2500
  * 返 回 值：无
  * 注意事项：CCR和ARR共同决定占空比，此函数仅设置CCR的值，并不直接是占空比
  *           占空比Duty = CCR / (ARR + 1)
  *           此函数用于控制PB6引脚上的舵机4
  */
void PWM_SetCompare4_TIM4(uint16_t Compare)
{
	TIM_SetCompare1(TIM4, Compare);		//设置TIM4的CCR1的值 (PB6-舵机4)
}

/**
  * 函    数：PWM设置CCR (TIM4通道2, PB7-舵机5)
  * 参    数：Compare 要写入的CCR的值，范围：0~2500
  * 返 回 值：无
  */
void PWM_SetCompare_TIM4CH2(uint16_t Compare)
{
	TIM_SetCompare2(TIM4, Compare);		//设置TIM4的CCR2的值 (PB7-舵机5)
}

/**
  * 函    数：PWM设置CCR (TIM4通道4, PB9-舵机6)
  * 参    数：Compare 要写入的CCR的值，范围：0~2500
  * 返 回 值：无
  */
void PWM_SetCompare_TIM4CH4(uint16_t Compare)
{
	TIM_SetCompare4(TIM4, Compare);		//设置TIM4的CCR4的值 (PB9-舵机6)
}
